app/controllers/news_controller.rb

	def index
		@news_list = News.all
---
SELECT "news".* FROM "news"

	def create
		@news = News.new(news_params)
		@news.save
---
INSERT INTO "news" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test create"], ["content", "create"], ["created_at", "2015-07-01 16:49:03.425143"], ["updated_at", "2015-07-01 16:49:03.425143"]]

	def update
		@news = News.find(params[:id])
		@news.update(news_params)
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "news" SET "title" = $1, "updated_at" = $2 WHERE "news"."id" = $3  [["title", "test news~"], ["updated_at", "2015-07-01 18:03:08.299714"], ["id", 1]]

	def show
		@news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 1]]

	def edit
		@news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 1]]