app/controllers/page_controller.rb

SELECT "news".* FROM "news"
---
	def index
		@news = News.all