app/controllers/witness_controller.rb

SELECT  "witnesses".* FROM "witnesses" WHERE "witnesses"."is_active" = 't'  ORDER BY "witnesses"."created_at" DESC LIMIT 10
---
    def index
      #
      @witnesses = Witness.where(is_active: true).order(:created_at).reverse_order.take(10)

INSERT INTO "witnesses" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test witness"], ["content", "test witness content"], ["created_at", "2015-07-08 18:25:06.873469"], ["updated_at", "2015-07-08 18:25:06.873469"]]
---
    def create
      @witness = Witness.new(witness_params)
      @witness.save

SELECT  "witnesses".* FROM "witnesses" WHERE "witnesses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "witnesses" SET "photo" = $1, "updated_at" = $2 WHERE "witnesses"."id" = $3  [["photo", "//placehold.it/800x600"], ["updated_at", "2015-07-16 13:51:31.511928"], ["id", 2]]
---
    def update
      @witness = Witness.find(params[:id])
      photo = save_photo()
      @witness.update(witness_params)

SELECT  "witnesses".* FROM "witnesses" WHERE "witnesses"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
      @witness = Witness.find(params[:id])

SELECT  "witnesses".* FROM "witnesses" WHERE "witnesses"."id" = $1 LIMIT 1  [["id", 1]]
---
    def edit
      @witness = Witness.find(params[:id])

SELECT  "witnesses".* FROM "witnesses" WHERE "witnesses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "witnesses" SET "is_active" = $1, "updated_at" = $2 WHERE "witnesses"."id" = $3  [["is_active", "f"], ["updated_at", "2015-07-18 17:49:05.573952"], ["id", 2]]
---
    def destroy
      @witness = Witness.find(params[:id])
      @witness.update(is_active: false)