app/controllers/witness_controller.rb

    def index
      @witnesses = Witness.all
---
SELECT "witnesses".* FROM "witnesses"